.de LG
.nr PS 18
..
.de NL
.nr PS 10
..
.de BI
.IP \ \ \ \(bu
..

.ds CH "\fIRevision 1.00\fR
.ds RH Page %
.ds CF "Tape Handling under IRAF
.ds RF "

.LG
.IP
\fBTape Handling under IRAF\fR \fI(Revision 1.00)\fR
.NL
.sp 1
.NH
\fBDevice Names\fR
.sp 1
.PP
IRAF users are accustomed to using "mta", "mtb", etc. to refer
to 9-track tape drives.  The following table gives the appropriate
correspondences on our system:
.DS
mta = tape0   on cfa200 (a.k.a. spock) (1600 bpi)
mtb = tape1   on cfa200 (a.k.a. spock) (1600 and 6250 bpi)
mtb = tape2   on cfa250 (a.k.a. kirk)  (1600 and 6250 bpi)
.DE
.LP
The "mta" drive is single density and only lives on cfa200.  The "mtb"
drives are dual density with each file server having its own hardware.
.sp 1
.NH
\fBDevice Allocation\fR
.sp 1
.PP
Tape drive allocation occurs at two levels.  You must execute the
\fBgetdev\fR command first, specifying either "tape0" or "tape1", to
reserve a tape drive.  The \fBgetdev\fR command can be executed either
inside IRAF or outside.  Once you have the drive assigned, then
you must execute the IRAF \fBallocate\fR command with either "mta" or
"mtb".  This redundancy is necessary because IRAF maintains its
own bookkeeping scheme about drive usage.  Always refer to the
drives as "mta" or "mtb" inside of IRAF.
.PP
Deallocation occurs in the reverse order.  First, you execute the
IRAF \fBdealloc\fR command, and then the HEAD system \fBrlsdev\fR command.
.sp 1
.NH
\fBTapes on Remote Nodes\fR
.sp 1
.PP
Starting with version 2.6 of IRAF, it is no longer necessary to
directly log onto a workstation with a tape drive in order to
use that tape drive.  To use this facility you must
create a \fI.irafhosts\fR file in your home directory (the one with your .login
file).
.LP
The format of the .irafhosts file is as follows:
.DS
alias1 alias2 ... aliasN  :  loginname password
(etc.)
.DE
.LP
If the host alias "*" is encountered, the login name and password given
in that record are used.  If the password "?" is encountered, the actual
password is obtained by querying the user terminal (this will fail for
a batch job, but it keeps the rest of the world from easily reading
your password in this file).
.sp 1
.LP
The syntax for using a drive name on a local node is:
.DS
mta,  mta1600,  mta1600[1],  (etc.)     # local node
.DE
.LP
The syntax for using a drive name on a remote node is:
.DS
node!mta,  node!mta1600                 # remote node
.DE
.bp
.NH
\fBSample Session\fR
.sp 1
.DS
da> !rsh kirk getdev tape2
You have the 'tape2'. Please 'rlsdev' it when done.
da> alloc kirk!mtb
Password (adam@cfa250):
da> wfits dev$pix kirk!mtb6250[1]
File 1: dev$pix -> kirk!mtb6250[1] m51  B  600s          Size = 512 x 512
da> dealloc kirk!mtb
da> !rsh kirk rlsdev tape2
tape2 released.
da> 
.DE


